experiment/results/no_istio_20260105_141518/wrk_logs/wrk_1000rps_rep1.log
Running 2m test @ http://localhost:31643
  4 threads and 100 connections

  Thread calibration: mean lat.: 13.033ms, rate sampling interval: 68ms
  Thread calibration: mean lat.: 11.882ms, rate sampling interval: 65ms
  Thread calibration: mean lat.: 12.355ms, rate sampling interval: 66ms
  Thread calibration: mean lat.: 13.026ms, rate sampling interval: 70ms

-----------------------------------------------------------------------
Test Results @ http://localhost:31643 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    13.66ms   16.98ms  66.24ms   84.72%
    Req/Sec   251.95     62.50   405.00     68.58%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    4.43ms
 75.000%   22.03ms
 90.000%   37.69ms
 99.000%   66.24ms
 99.900%  124.03ms
 99.990%  217.47ms
 99.999%  258.82ms
100.000%  271.87ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.268     0.000000            1         1.00
       1.683     0.100000        11031         1.11
       1.931     0.200000        22054         1.25
       2.533     0.300000        33064         1.43
       3.535     0.400000        44079         1.67
       4.431     0.500000        55103         2.00
       5.159     0.550000        60623         2.22
       6.631     0.600000        66119         2.50
      14.711     0.650000        71635         2.86
      18.719     0.700000        77144         3.33
      22.031     0.750000        82656         4.00
      23.855     0.775000        85405         4.44
      25.887     0.800000        88162         5.00
      28.287     0.825000        90932         5.71
      30.959     0.850000        93667         6.67
      34.079     0.875000        96431         8.00
      35.807     0.887500        97818         8.89
      37.695     0.900000        99194        10.00
      39.871     0.912500       100566        11.43
      42.207     0.925000       101953        13.33
      44.863     0.937500       103315        16.00
      46.335     0.943750       104005        17.78
      47.935     0.950000       104696        20.00
      49.599     0.956250       105374        22.86
      51.679     0.962500       106064        26.67
      53.951     0.968750       106753        32.00
      55.135     0.971875       107095        35.56
      56.575     0.975000       107446        40.00
      57.823     0.978125       107788        45.71
      59.487     0.981250       108135        53.33
      61.279     0.984375       108476        64.00
      62.399     0.985938       108648        71.11
      63.743     0.987500       108820        80.00
      65.247     0.989062       108989        91.43
      67.007     0.990625       109168       106.67
      69.375     0.992188       109336       128.00
      70.847     0.992969       109421       142.22
      72.831     0.993750       109509       160.00
      75.455     0.994531       109595       182.86
      78.079     0.995313       109678       213.33
      81.727     0.996094       109765       256.00
      84.415     0.996484       109809       284.44
      86.911     0.996875       109850       320.00
      91.647     0.997266       109894       365.71
      96.255     0.997656       109936       426.67
     102.079     0.998047       109979       512.00
     105.023     0.998242       110001       568.89
     109.119     0.998437       110022       640.00
     113.535     0.998633       110045       731.43
     116.991     0.998828       110065       853.33
     126.783     0.999023       110087      1024.00
     132.095     0.999121       110098      1137.78
     137.727     0.999219       110108      1280.00
     145.407     0.999316       110119      1462.86
     152.447     0.999414       110130      1706.67
     157.823     0.999512       110141      2048.00
     163.199     0.999561       110147      2275.56
     165.119     0.999609       110151      2560.00
     167.935     0.999658       110157      2925.71
     170.623     0.999707       110162      3413.33
     181.119     0.999756       110168      4096.00
     183.039     0.999780       110170      4551.11
     196.223     0.999805       110173      5120.00
     203.903     0.999829       110176      5851.43
     208.767     0.999854       110178      6826.67
     215.423     0.999878       110181      8192.00
     215.807     0.999890       110182      9102.22
     218.239     0.999902       110184     10240.00
     222.975     0.999915       110185     11702.86
     226.047     0.999927       110186     13653.33
     230.015     0.999939       110188     16384.00
     230.015     0.999945       110188     18204.44
     240.127     0.999951       110189     20480.00
     249.855     0.999957       110190     23405.71
     249.855     0.999963       110190     27306.67
     256.895     0.999969       110191     32768.00
     256.895     0.999973       110191     36408.89
     257.791     0.999976       110192     40960.00
     257.791     0.999979       110192     46811.43
     257.791     0.999982       110192     54613.33
     258.815     0.999985       110193     65536.00
     258.815     0.999986       110193     72817.78
     258.815     0.999988       110193     81920.00
     258.815     0.999989       110193     93622.86
     258.815     0.999991       110193    109226.67
     271.871     0.999992       110194    131072.00
     271.871     1.000000       110194          inf
#[Mean    =       13.657, StdDeviation   =       16.979]
#[Max     =      271.616, Total count    =       110194]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  120113 requests in 2.00m, 52.31MB read
Requests/sec:   1000.92  
Transfer/sec:    446.37KB