experiment/results/no_istio_20260105_141518/wrk_logs/wrk_2000rps_rep1.log
Running 2m test @ http://localhost:31643
  4 threads and 100 connections

  Thread calibration: mean lat.: 33.840ms, rate sampling interval: 175ms
  Thread calibration: mean lat.: 37.661ms, rate sampling interval: 181ms
  Thread calibration: mean lat.: 33.805ms, rate sampling interval: 166ms
  Thread calibration: mean lat.: 37.147ms, rate sampling interval: 187ms

-----------------------------------------------------------------------
Test Results @ http://localhost:31643 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    44.37ms   50.76ms 227.58ms   86.47%
    Req/Sec   502.05     60.27   648.00     70.40%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   27.36ms
 75.000%   65.86ms
 90.000%  109.44ms
 99.000%  227.58ms
 99.900%  349.18ms
 99.990%  497.15ms
 99.999%  690.69ms
100.000%  719.36ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.032     0.000000            2         1.00
       2.297     0.100000        22050         1.11
       4.815     0.200000        44082         1.25
       8.519     0.300000        66142         1.43
      14.567     0.400000        88171         1.67
      27.359     0.500000       110210         2.00
      34.303     0.550000       121241         2.22
      41.055     0.600000       132252         2.50
      48.383     0.650000       143294         2.86
      56.575     0.700000       154319         3.33
      65.855     0.750000       165339         4.00
      70.847     0.775000       170865         4.44
      76.543     0.800000       176352         5.00
      82.879     0.825000       181870         5.71
      90.175     0.850000       187358         6.67
      98.879     0.875000       192869         8.00
     103.935     0.887500       195651         8.89
     109.439     0.900000       198380        10.00
     115.839     0.912500       201119        11.43
     123.775     0.925000       203877        13.33
     132.863     0.937500       206633        16.00
     138.111     0.943750       208009        17.78
     144.127     0.950000       209383        20.00
     150.911     0.956250       210775        22.86
     158.719     0.962500       212148        26.67
     168.191     0.968750       213529        32.00
     173.183     0.971875       214214        35.56
     179.327     0.975000       214898        40.00
     186.239     0.978125       215583        45.71
     194.431     0.981250       216274        53.33
     204.799     0.984375       216963        64.00
     209.791     0.985938       217303        71.11
     216.319     0.987500       217660        80.00
     223.103     0.989062       217993        91.43
     230.911     0.990625       218336       106.67
     240.639     0.992188       218684       128.00
     245.247     0.992969       218853       142.22
     251.391     0.993750       219026       160.00
     258.175     0.994531       219197       182.86
     266.751     0.995313       219369       213.33
     277.759     0.996094       219543       256.00
     283.647     0.996484       219628       284.44
     290.559     0.996875       219714       320.00
     298.495     0.997266       219801       365.71
     305.663     0.997656       219887       426.67
     316.415     0.998047       219972       512.00
     322.559     0.998242       220016       568.89
     327.679     0.998437       220058       640.00
     334.079     0.998633       220101       731.43
     340.991     0.998828       220147       853.33
     349.695     0.999023       220189      1024.00
     353.023     0.999121       220210      1137.78
     357.887     0.999219       220230      1280.00
     364.543     0.999316       220252      1462.86
     371.711     0.999414       220273      1706.67
     382.463     0.999512       220295      2048.00
     389.887     0.999561       220306      2275.56
     398.335     0.999609       220316      2560.00
     408.575     0.999658       220327      2925.71
     419.327     0.999707       220338      3413.33
     430.591     0.999756       220349      4096.00
     435.199     0.999780       220354      4551.11
     438.783     0.999805       220359      5120.00
     453.631     0.999829       220365      5851.43
     462.591     0.999854       220370      6826.67
     464.127     0.999878       220376      8192.00
     474.879     0.999890       220378      9102.22
     503.039     0.999902       220381     10240.00
     531.967     0.999915       220384     11702.86
     540.159     0.999927       220386     13653.33
     564.735     0.999939       220389     16384.00
     584.703     0.999945       220390     18204.44
     637.951     0.999951       220392     20480.00
     654.335     0.999957       220393     23405.71
     669.695     0.999963       220394     27306.67
     679.423     0.999969       220397     32768.00
     679.423     0.999973       220397     36408.89
     679.423     0.999976       220397     40960.00
     680.447     0.999979       220398     46811.43
     680.447     0.999982       220398     54613.33
     685.567     0.999985       220399     65536.00
     685.567     0.999986       220399     72817.78
     690.687     0.999988       220400     81920.00
     690.687     0.999989       220400     93622.86
     690.687     0.999991       220400    109226.67
     703.999     0.999992       220401    131072.00
     703.999     0.999993       220401    145635.56
     703.999     0.999994       220401    163840.00
     703.999     0.999995       220401    187245.71
     703.999     0.999995       220401    218453.33
     719.359     0.999996       220402    262144.00
     719.359     1.000000       220402          inf
#[Mean    =       44.367, StdDeviation   =       50.765]
#[Max     =      718.848, Total count    =       220402]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  239737 requests in 2.00m, 81.52MB read
Requests/sec:   1997.65  
Transfer/sec:    695.59KB